Revit 2024 API
ViewSheetSet.ViewOrganizationId Property
ElementId to the BrowserOrganization for non-sheet views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ElementId ViewOrganizationId { get; set; }
Visual Basic
Public Overridable Property ViewOrganizationId As ElementId
	Get
	Set
Visual C++
public:
virtual property ElementId^ ViewOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Implements
IViewSheetSet.ViewOrganizationId
Remarks
 Ignored when [!:Autodesk::Revit::DB::PrintSetup::IsAutomatic] is false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible.
See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace